In [ ]:
# First unzip the dataset and get the path for it
!unzip /content/titanic.zip

Archive:  /content/titanic.zip
replace gender_submission.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: n
replace test.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: n
replace train.csv? [y]es, [n]o, [A]ll, [N]one, [r]ename: n

In [ ]:
# read train and test datasets
import pandas as pd
dataset = pd.read_csv('/content/train.csv')
trainset= pd.read_csv('/content/test.csv')

In [ ]:
# preview the dataset and see how it looks like
dataset

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
trainset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [ ]:
len(set(dataset.Embarked))

4

In [ ]:

data = pd.get_dummies(dataset,columns=['Sex','Embarked'])
df   = pd.get_dummies(trainset,columns=['Sex','Embarked'])

In [ ]:
data

     PassengerId  Survived  Pclass  ... Embarked_C  Embarked_Q  Embarked_S
0              1         0       3  ...          0           0           1
1              2         1       1  ...          1           0           0
2              3         1       3  ...          0           0           1
3              4         1       1  ...          0           0           1
4              5         0       3  ...          0           0           1
..           ...       ...     ...  ...        ...         ...         ...
886          887         0       2  ...          0           0           1
887          888         1       1  ...          0           0           1
888          889         0       3  ...          0           0           1
889          890         1       1  ...          1           0           0
890          891         0       3  ...          0           1           0

[891 rows x 15 columns]

In [ ]:
df

     PassengerId  Pclass  ... Embarked_Q  Embarked_S
0            892       3  ...          1           0
1            893       3  ...          0           1
2            894       2  ...          1           0
3            895       3  ...          0           1
4            896       3  ...          0           1
..           ...     ...  ...        ...         ...
413         1305       3  ...          0           1
414         1306       1  ...          0           0
415         1307       3  ...          0           1
416         1308       3  ...          0           1
417         1309       3  ...          0           0

[418 rows x 14 columns]

In [ ]:
import numpy as np
from sklearn.impute import SimpleImputer
x1 = data['Age'].values.reshape(-1,1)
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')
imp_mean.fit(x1)

x2 = df['Age'].values.reshape(-1,1)
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')
imp_mean.fit(x2)

x3 = df['Fare'].values.reshape(-1,1)
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')
imp_mean.fit(x3)

SimpleImputer(add_indicator=False, copy=True, fill_value=None,
              missing_values=nan, strategy='mean', verbose=0)

In [ ]:
imp_mean.transform(x1)
imp_mean.transform(x2)

In [ ]:
X = data[['Age','Pclass','SibSp','Parch','Fare','Sex_male','Embarked_C','Embarked_Q','Embarked_S']]
X2  = df[['Age','Pclass','SibSp','Parch','Fare','Sex_male','Embarked_C','Embarked_Q','Embarked_S']]

In [ ]:
X['Age'] = imp_mean.transform(x1)
X2['Age']= imp_mean.transform(x2)
X2['Fare']=imp_mean.transform(x3)

In [ ]:
X['Age']

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    35.627188
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [ ]:
y = data['Survived']

In [ ]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()
scaler.fit(X)
X = scaler.transform(X)
X2= scaler.transform(X2)

In [ ]:
X2[:20,:]

array([[0.4282483 , 1.        , 0.        , 0.        , 0.01528158,
        1.        , 0.        , 1.        , 0.        ],
       [0.58532295, 1.        , 0.125     , 0.        , 0.01366309,
        0.        , 0.        , 0.        , 1.        ],
       [0.77381252, 0.5       , 0.        , 0.        , 0.01890874,
        1.        , 0.        , 1.        , 0.        ],
       [0.33400352, 1.        , 0.        , 0.        , 0.01690807,
        1.        , 0.        , 0.        , 1.        ],
       [0.27117366, 1.        , 0.125     , 0.16666667, 0.0239836 ,
        0.        , 0.        , 0.        , 1.        ],
       [0.17064589, 1.        , 0.        , 0.        , 0.018006  ,
        1.        , 0.        , 0.        , 1.        ],
       [0.37170143, 1.        , 0.        , 0.        , 0.01489121,
        0.        , 0.        , 1.        , 0.        ],
       [0.32143755, 0.5       , 0.125     , 0.16666667, 0.05660423,
        1.        , 0.        , 0.        , 1.        ],
       [0.22090978, 1.        , 0.        , 0.        , 0.01411046,
        0.        , 1.        , 0.        , 0.        ],
       [0.25860769, 1.        , 0.25      , 0.        , 0.04713766,
        1.        , 0.        , 0.        , 1.        ],
       [0.3751268 , 1.        , 0.        , 0.        , 0.01541158,
        1.        , 0.        , 0.        , 1.        ],
       [0.57275697, 0.        , 0.        , 0.        , 0.05074862,
        1.        , 0.        , 0.        , 1.        ],
       [0.28373963, 0.        , 0.125     , 0.        , 0.1605739 ,
        0.        , 0.        , 0.        , 1.        ],
       [0.78637849, 0.5       , 0.125     , 0.        , 0.05074862,
        1.        , 0.        , 0.        , 1.        ],
       [0.58532295, 0.        , 0.125     , 0.        , 0.11940565,
        0.        , 0.        , 0.        , 1.        ],
       [0.2963056 , 0.5       , 0.125     , 0.        , 0.0541074 ,
        0.        , 1.        , 0.        , 0.        ],
       [0.43453129, 0.5       , 0.        , 0.        , 0.02410559,
        1.        , 0.        , 1.        , 0.        ],
       [0.25860769, 1.        , 0.        , 0.        , 0.01410226,
        1.        , 1.        , 0.        , 0.        ],
       [0.33400352, 1.        , 0.125     , 0.        , 0.01546857,
        0.        , 0.        , 0.        , 1.        ],
       [0.560191  , 1.        , 0.        , 0.        , 0.01410226,
        0.        , 1.        , 0.        , 0.        ]])

In [ ]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X, y, test_size=0.2)

In [ ]:
from sklearn.ensemble import GradientBoostingClassifier

clf = GradientBoostingClassifier(random_state=0)
clf.fit(X, y)
clf.score(X_test,y_test)

0.9217877094972067

In [ ]:
from sklearn.ensemble import RandomForestClassifier,AdaBoostClassifier

clf = RandomForestClassifier(max_depth=5, random_state=0,max_features=4)
clf.fit(X,y)
clf.score(X_test,y_test)

0.8100558659217877

In [ ]:
clf = AdaBoostClassifier()
clf.fit(X, y)
clf.score(X_test,y_test)

0.8268156424581006

In [ ]:
from sklearn.svm import SVC

clf = SVC(kernel="linear", C=0.025)
clf.fit(X, y)
clf.score(X_test,y_test)

0.7988826815642458

In [ ]:
from sklearn.svm import SVC

clf = SVC(kernel="rbf", gamma=9,C=1,degree=value)
clf.fit(X, y)
clf.score(X_train,y_train)

0.8356741573033708

In [ ]:
from sklearn.neighbors import KNeighborsClassifier

clf = KNeighborsClassifier(n_neighbors=4)
clf.fit(X, y)
clf.score(X_train,y_train)

0.8525280898876404

In [ ]:
y_pred = clf.predict(X2)

In [ ]:
X2[:5]

array([[0.4282483 , 1.        , 0.        , 0.        , 0.01528158,
        1.        , 0.        , 1.        , 0.        ],
       [0.58532295, 1.        , 0.125     , 0.        , 0.01366309,
        0.        , 0.        , 0.        , 1.        ],
       [0.77381252, 0.5       , 0.        , 0.        , 0.01890874,
        1.        , 0.        , 1.        , 0.        ],
       [0.33400352, 1.        , 0.        , 0.        , 0.01690807,
        1.        , 0.        , 0.        , 1.        ],
       [0.27117366, 1.        , 0.125     , 0.16666667, 0.0239836 ,
        0.        , 0.        , 0.        , 1.        ]])

In [ ]:
results = ids.assign(Survived = y_pred[-418:])
results.to_csv("/content/gender_submission.csv", index=False)